In [1]:
# Pandas

In [2]:
import pandas as pd

In [3]:
# series

In [4]:
Age = pd.Series([10, 20, 30, 40], index=["age1", "age2", "age3", "age4"])
Age

age1    10
age2    20
age3    30
age4    40
dtype: int64

In [5]:
Age.age3

30

In [6]:
Filtered_Age = Age[Age>20]
print(Filtered_Age)

age3    30
age4    40
dtype: int64

In [7]:
# calling values of the series
Age.values

array([10, 20, 30, 40])

In [8]:
# calling indices of the series
Age.index

Index(['age1', 'age2', 'age3', 'age4'], dtype='object')

In [9]:
Age.index = ["A1", "A2", "A3", "A4"]

In [10]:
Age.index

Index(['A1', 'A2', 'A3', 'A4'], dtype='object')

In [11]:
Age

A1    10
A2    20
A3    30
A4    40
dtype: int64

In [12]:
import numpy as np

In [13]:
DF = np.array([[20, 10,8], [25, 8, 10], [27, 5, 3], [30, 9, 7]])

In [14]:
Data_Set = pd.DataFrame(DF)
print(Data_Set)

    0   1   2
0  20  10   8
1  25   8  10
2  27   5   3
3  30   9   7

In [15]:
Data_Set = pd.DataFrame(DF, index = ["S1", "S2", "S3", "S4"])
print(Data_Set)

     0   1   2
S1  20  10   8
S2  25   8  10
S3  27   5   3
S4  30   9   7

In [16]:
Data_Set = pd.DataFrame(DF, index = ["S1", "S2", "S3", "S4"], columns=["Age", "Grade1", "Grade2"])
print(Data_Set)

    Age  Grade1  Grade2
S1   20      10       8
S2   25       8      10
S3   27       5       3
S4   30       9       7

In [17]:
Data_Set["Grade3"] = [9,6,7,10]

In [18]:
print(Data_Set)

    Age  Grade1  Grade2  Grade3
S1   20      10       8       9
S2   25       8      10       6
S3   27       5       3       7
S4   30       9       7      10

In [19]:
# access for label
Data_Set.loc["S2"]

Age       25
Grade1     8
Grade2    10
Grade3     6
Name: S2, dtype: int64

In [20]:
# position
Data_Set.iloc[1][3]

6

In [21]:
Data_Set.iloc[1,3]

6

In [22]:
Data_Set.iloc[:,0]

S1    20
S2    25
S3    27
S4    30
Name: Age, dtype: int64

In [23]:
Data_Set.iloc[:]

    Age  Grade1  Grade2  Grade3
S1   20      10       8       9
S2   25       8      10       6
S3   27       5       3       7
S4   30       9       7      10

In [24]:
Data_Set.iloc[:,3]

S1     9
S2     6
S3     7
S4    10
Name: Grade3, dtype: int64

In [25]:
Filtered_Data = Data_Set.iloc[:,1:3]

In [26]:
Filtered_Data

    Grade1  Grade2
S1      10       8
S2       8      10
S3       5       3
S4       9       7

In [27]:
Data_Set.drop("Grade1", axis=1)

    Age  Grade2  Grade3
S1   20       8       9
S2   25      10       6
S3   27       3       7
S4   30       7      10

In [28]:
Data_Set = Data_Set.replace(10, 12)

In [29]:
Data_Set

    Age  Grade1  Grade2  Grade3
S1   20      12       8       9
S2   25       8      12       6
S3   27       5       3       7
S4   30       9       7      12

In [30]:
Data_Set = Data_Set.replace({12:10, 9:30})
Data_Set

    Age  Grade1  Grade2  Grade3
S1   20      10       8      30
S2   25       8      10       6
S3   27       5       3       7
S4   30      30       7      10

In [31]:
Data_Set.head(3)

    Age  Grade1  Grade2  Grade3
S1   20      10       8      30
S2   25       8      10       6
S3   27       5       3       7

In [32]:
Data_Set.tail(2)

    Age  Grade1  Grade2  Grade3
S3   27       5       3       7
S4   30      30       7      10

In [39]:
Data_Set.sort_values("Grade1", ascending=True)

    Age  Grade1  Grade2  Grade3
S3   27       5       3       7
S2   25       8      10       6
S1   20      10       8      30
S4   30      30       7      10

In [41]:
Data_Set.sort_index(axis=0, ascending=True)

    Age  Grade1  Grade2  Grade3
S1   20      10       8      30
S2   25       8      10       6
S3   27       5       3       7
S4   30      30       7      10

In [42]:
Data = pd.read_csv("Data_Set.csv")

In [43]:
Data

,Name of the data = Home Consumption,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,Unit = kW and $/kW,NaN,NaN,NaN,NaN,NaN
1,Time,E_Plug,E_Heat,Price,Temperature,No. Occupants
2,1,24,28,10,-15,12
3,2,17,32,12,-17,12
4,3,16,34,11,-19,12
5,3,16,34,11,-19,12
6,4,16,33,12,-18,12
7,5,16,30,10,-14,12
8,6,16,31,10,-16,12
9,7,19,28,14,-14,12
10,8,22,29,12,-15,9
11,9,25,26,12,-12,8
12,10,26,24,14,-8,8
13,11,27,20,14,-4,8
14,12,30,19,16,0,5
15,13,30,19,16,0,4
16,14,NaN,13,17,2,4
17,15,27,14,17,3,4
18,16,27,16,17,2,6
19,17,28,-4,18,0,8
20,18,33,26,20,-6,9
21,19,42,32,21,-8,10
22,20,120,33,21,-12,12
23,21,47,32,21,-16,12
24,22,44,30,22,-18,12
25,23,36,35,!,-19,12
26,24,37,36,18,-22,12